# SETUP

In [7]:
%sql sqlite:///data/sample.db

In [10]:
%%sql

CREATE TABLE artist (artist_id, name);
CREATE TABLE album (album_id, title, artist_id);

 * sqlite:///data/sample.db
Done.
Done.

[]

In [13]:
%%sql 

INSERT INTO artist VALUES (1, "AC/DC");
INSERT INTO artist VALUES (2, "Aerosmith");
INSERT INTO artist VALUES (3, "Alanis Morissette");

 * sqlite:///data/sample.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql 

INSERT INTO album VALUES (1, "For those who rock", 1);
INSERT INTO album VALUES (2, "Balls to the wall", 2);
INSERT INTO album VALUES (3, "Restless and wild", 2);
INSERT INTO album VALUES (4, "Let there be rock", 1);
INSERT INTO album VALUES (5, "Rumours", 6);

 * sqlite:///data/sample.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%sql select * from artist

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC'), (2, 'Aerosmith'), (3, 'Alanis Morissette')]

In [23]:
%sql select * from album

 * sqlite:///data/sample.db
Done.

[(1, 'For those who rock', 1),
 (2, 'Balls to the wall', 2),
 (3, 'Restless and wild', 2),
 (4, 'Let there be rock', 1),
 (5, 'Rumours', 6)]

# INNER JOIN

In [41]:
%%sql SELECT * FROM artist as at
INNER JOIN album as al
ON at.artist_id = al.artist_id;

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC', 1, 'For those who rock', 1),
 (1, 'AC/DC', 4, 'Let there be rock', 1),
 (2, 'Aerosmith', 2, 'Balls to the wall', 2),
 (2, 'Aerosmith', 3, 'Restless and wild', 2)]

In [39]:
table.DataFrame().to_csv("data/inner_join.csv", index=False)

In [31]:
%%sql

SELECT * FROM artist as at
INNER JOIN album as al
USING (artist_id)

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC', 1, 'For those who rock'),
 (1, 'AC/DC', 4, 'Let there be rock'),
 (2, 'Aerosmith', 2, 'Balls to the wall'),
 (2, 'Aerosmith', 3, 'Restless and wild')]

# SELF JOIN

In [57]:
%%sql

SELECT a1.title, a2.artist_id, a1.album_id
FROM album a1
JOIN album a2 
ON a1.artist_id = a2.artist_id;

 * sqlite:///data/sample.db
Done.

[('For those who rock', 1, 1),
 ('For those who rock', 1, 1),
 ('Balls to the wall', 2, 2),
 ('Balls to the wall', 2, 2),
 ('Restless and wild', 2, 3),
 ('Restless and wild', 2, 3),
 ('Let there be rock', 1, 4),
 ('Let there be rock', 1, 4),
 ('Rumours', 6, 5)]

# LEFT JOIN

In [60]:
%%sql

SELECT *
FROM artist at
LEFT JOIN album al
ON at.artist_id = al.artist_id;

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC', 1, 'For those who rock', 1),
 (1, 'AC/DC', 4, 'Let there be rock', 1),
 (2, 'Aerosmith', 2, 'Balls to the wall', 2),
 (2, 'Aerosmith', 3, 'Restless and wild', 2),
 (3, 'Alanis Morissette', None, None, None)]

In [61]:
table = _

In [64]:
table.DataFrame().to_csv("data/left_join.csv", index=False)

# RIGHT JOIN

In [66]:
%%sql

SELECT *
FROM album al
LEFT JOIN artist at
ON al.artist_id = at.artist_id;

 * sqlite:///data/sample.db
Done.

[(1, 'For those who rock', 1, 1, 'AC/DC'),
 (2, 'Balls to the wall', 2, 2, 'Aerosmith'),
 (3, 'Restless and wild', 2, 2, 'Aerosmith'),
 (4, 'Let there be rock', 1, 1, 'AC/DC'),
 (5, 'Rumours', 6, None, None)]

In [67]:
table = _
table.DataFrame().to_csv("data/right_join.csv", index=False)

## FULL JOIN

In [68]:
%%sql

SELECT *
FROM artist at
LEFT JOIN album al
ON at.artist_id = al.artist_id
UNION ALL
SELECT *
FROM album al
LEFT JOIN artist at
ON al.artist_id = at.artist_id
WHERE at.name IS NULL

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC', 1, 'For those who rock', 1),
 (1, 'AC/DC', 4, 'Let there be rock', 1),
 (2, 'Aerosmith', 2, 'Balls to the wall', 2),
 (2, 'Aerosmith', 3, 'Restless and wild', 2),
 (3, 'Alanis Morissette', None, None, None),
 (5, 'Rumours', 6, None, None)]

```sql
SELECT *
FROM artist at
FULL OUTER JOIN album al
ON at.artist_id = al.artists_id
```

In [69]:
table = _
table.DataFrame().to_csv("data/full_join.csv", index=False)

## CROSS JOIN

In [70]:
%%sql

SELECT *
FROM artist
CROSS JOIN album

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC', 1, 'For those who rock', 1),
 (1, 'AC/DC', 2, 'Balls to the wall', 2),
 (1, 'AC/DC', 3, 'Restless and wild', 2),
 (1, 'AC/DC', 4, 'Let there be rock', 1),
 (1, 'AC/DC', 5, 'Rumours', 6),
 (2, 'Aerosmith', 1, 'For those who rock', 1),
 (2, 'Aerosmith', 2, 'Balls to the wall', 2),
 (2, 'Aerosmith', 3, 'Restless and wild', 2),
 (2, 'Aerosmith', 4, 'Let there be rock', 1),
 (2, 'Aerosmith', 5, 'Rumours', 6),
 (3, 'Alanis Morissette', 1, 'For those who rock', 1),
 (3, 'Alanis Morissette', 2, 'Balls to the wall', 2),
 (3, 'Alanis Morissette', 3, 'Restless and wild', 2),
 (3, 'Alanis Morissette', 4, 'Let there be rock', 1),
 (3, 'Alanis Morissette', 5, 'Rumours', 6)]

In [71]:
table = _
table.DataFrame().to_csv("data/cross_join.csv", index=False)

## UNION

In [72]:
%sql select * from artist

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC'), (2, 'Aerosmith'), (3, 'Alanis Morissette')]

In [74]:
%sql select * from album

 * sqlite:///data/sample.db
Done.

[(1, 'For those who rock', 1),
 (2, 'Balls to the wall', 2),
 (3, 'Restless and wild', 2),
 (4, 'Let there be rock', 1),
 (5, 'Rumours', 6)]

In [77]:
%%sql

SELECT *
FROM artist at
LEFT JOIN album al
ON at.artist_id = al.artist_id

UNION

SELECT *
FROM album al
LEFT JOIN artist at
ON al.artist_id = at.artist_id

 * sqlite:///data/sample.db
Done.

[(1, 'AC/DC', 1, 'For those who rock', 1),
 (1, 'AC/DC', 4, 'Let there be rock', 1),
 (1, 'For those who rock', 1, 1, 'AC/DC'),
 (2, 'Aerosmith', 2, 'Balls to the wall', 2),
 (2, 'Aerosmith', 3, 'Restless and wild', 2),
 (2, 'Balls to the wall', 2, 2, 'Aerosmith'),
 (3, 'Alanis Morissette', None, None, None),
 (3, 'Restless and wild', 2, 2, 'Aerosmith'),
 (4, 'Let there be rock', 1, 1, 'AC/DC'),
 (5, 'Rumours', 6, None, None)]

In [78]:
table = _
table.DataFrame().to_csv("data/union.csv", index=False)

## UNION ALL

In [81]:
%%sql

SELECT *
FROM artist at
LEFT JOIN album al
ON at.artist_id = al.artist_id
WHERE al.album_id IS NULL

UNION ALL

SELECT *
FROM album al
LEFT JOIN artist at
ON al.artist_id = at.artist_id
WHERE at.name IS NULL

 * sqlite:///data/sample.db
Done.

[(3, 'Alanis Morissette', None, None, None), (5, 'Rumours', 6, None, None)]

In [82]:
table = _
table.DataFrame().to_csv("data/union_all.csv", index=False)

## INTERSECT

In [92]:
%%sql

SELECT at.name, al.title
FROM artist at
JOIN album al
ON at.artist_id = al.artist_id

INTERSECT

SELECT at.name, al.title
FROM artist at
LEFT JOIN album al
ON at.artist_id = al.artist_id

 * sqlite:///data/sample.db
Done.

[('AC/DC', 'For those who rock'),
 ('AC/DC', 'Let there be rock'),
 ('Aerosmith', 'Balls to the wall'),
 ('Aerosmith', 'Restless and wild')]

In [93]:
table = _
table.DataFrame().to_csv("intersect.csv", index=False)

## EXCEPT

In [96]:
%%sql 

SELECT at.name, al.title
FROM artist at
LEFT JOIN album al
ON at.artist_id = al.artist_id

EXCEPT

SELECT at.name, al.title
FROM artist at
JOIN album al
ON at.artist_id = al.artist_id

 * sqlite:///data/sample.db
Done.

[('Alanis Morissette', None)]

In [97]:
table = _
table.DataFrame().to_csv("except.csv", index=False)